## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/key_vault_with_access_policy/plan-target.txt
+++ b/examples/key_vault_with_access_policy/plan-pr.txt
@@ -76,71 +76,18 @@ Terraform will perform the following actions:
         }
     }
 
-  # module.subnet.azurerm_route_table.rt[0] will be created
-  + resource "azurerm_route_table" "rt" {
-      + bgp_route_propagation_enabled = true
-      + id                            = (known after apply)
-      + location                      = "canadacentral"
-      + name                          = "app-test-route-table"
-      + resource_group_name           = "rg-test-app"
-      + route                         = [
-          + {
-              + address_prefix         = "0.0.0.0/0"
-              + name                   = "rt-test"
-              + next_hop_type          = "Internet"
-                # (1 unchanged attribute hidden)
-            },
-        ]
-      + subnets                       = (known after apply)
-      + tags                          = {
-          + "Business_unit" = "corp"
-          + "Environment"   = "test"
-          + "Managedby"     = "hello@clouddrove.com"
-          + "Name"          = "app-test"
-          + "Repository"    = "https://github.com/clouddrove/terraform-azure-subnet.git"
-        }
-    }
-
-  # module.subnet.azurerm_subnet.subnet[0] will be created
+  # module.subnet.azurerm_subnet.subnet["subnet1"] will be created
   + resource "azurerm_subnet" "subnet" {
       + address_prefixes                              = [
-          + "10.30.1.0/24",
+          + "10.0.1.0/24",
         ]
       + default_outbound_access_enabled               = true
       + id                                            = (known after apply)
-      + name                                          = "app-subnet1"
-      + private_endpoint_network_policies             = "Disabled"
+      + name                                          = "subnet1"
+      + private_endpoint_network_policies             = "Enabled"
       + private_link_service_network_policies_enabled = true
       + resource_group_name                           = "rg-test-app"
-      + virtual_network_name                          = "app-test-vnet"
-    }
-
-  # module.subnet.azurerm_subnet.subnet[1] will be created
-  + resource "azurerm_subnet" "subnet" {
-      + address_prefixes                              = [
-          + "10.30.2.0/24",
-        ]
-      + default_outbound_access_enabled               = true
-      + id                                            = (known after apply)
-      + name                                          = "app-subnet2"
-      + private_endpoint_network_policies             = "Disabled"
-      + private_link_service_network_policies_enabled = true
-      + resource_group_name                           = "rg-test-app"
-      + virtual_network_name                          = "app-test-vnet"
-    }
-
-  # module.subnet.azurerm_subnet_route_table_association.main[0] will be created
-  + resource "azurerm_subnet_route_table_association" "main" {
-      + id             = (known after apply)
-      + route_table_id = (known after apply)
-      + subnet_id      = (known after apply)
-    }
-
-  # module.subnet.azurerm_subnet_route_table_association.main[1] will be created
-  + resource "azurerm_subnet_route_table_association" "main" {
-      + id             = (known after apply)
-      + route_table_id = (known after apply)
-      + subnet_id      = (known after apply)
+      + virtual_network_name                          = "vnet-app-test"
     }
 
   # module.vault.azurerm_key_vault.key_vault[0] will be created
@@ -305,27 +252,53 @@ Terraform will perform the following actions:
   # module.vnet.azurerm_virtual_network.vnet[0] will be created
   + resource "azurerm_virtual_network" "vnet" {
       + address_space                  = [
-          + "10.30.0.0/16",
+          + "10.0.0.0/16",
         ]
       + dns_servers                    = []
-      + flow_timeout_in_minutes        = 10
       + guid                           = (known after apply)
       + id                             = (known after apply)
       + location                       = "canadacentral"
-      + name                           = "app-test-vnet"
+      + name                           = "vnet-app-test"
       + private_endpoint_vnet_policies = "Disabled"
       + resource_group_name            = "rg-test-app"
       + subnet                         = (known after apply)
       + tags                           = {
-          + "Business_unit" = "corp"
-          + "Environment"   = "test"
-          + "Managedby"     = "hello@clouddrove.com"
-          + "Name"          = "app-test"
-          + "Repository"    = "https://github.com/clouddrove/terraform-azure-vnet"
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "app-test"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-vnet"
+        }
+    }
+
+  # module.subnet.module.route_table["route-table"].azurerm_route_table.rt will be created
+  + resource "azurerm_route_table" "rt" {
+      + bgp_route_propagation_enabled = false
+      + id                            = (known after apply)
+      + location                      = "canadacentral"
+      + name                          = "rt-route-table-test"
+      + resource_group_name           = "rg-test-app"
+      + route                         = [
+          + {
+              + address_prefix         = "0.0.0.0/0"
+              + name                   = "route-table"
+              + next_hop_type          = "Internet"
+                # (1 unchanged attribute hidden)
+            },
+        ]
+      + subnets                       = (known after apply)
+      + tags                          = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "route-table-test"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-subnet.git"
         }
     }
 
-Plan: 14 to add, 0 to change, 0 to destroy.
+Plan: 11 to add, 0 to change, 0 to destroy.
 
 Changes to Outputs:
   + id        = [

```

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azure-key-vault/actions/runs/15609889491)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->